// @ts-check
import { console } from '../libs/console.js';

// Написать программу, которая:
// Сгенерирует массив из 10 случайных чисел
// Выведет этот массив в консоль
// Написать функцию findMax(array), которая методом перебора элементов найдет наибольшее число из массива и вернет его
// Вывести наибольшее число из массива

// Для генерации числа использовать функцию random из урока `8-random-in-range.mjs`

// Темы: 
// - Циклы
// - Операции сравнения (<, >, ..)

// Дополнтельно
// Написать функцию findMin и вывести минимальный элемент массива

async function main() {

}

main();