// @ts-check
import { console } from '../libs/console.js';

// Написать программу, которая будет производить указанное действие (+ - * /) с двумя введенными числами (a и b)
// Ввести: число a
// Ввести: действие
// Ввести: число b
// Ввести: результат действия

// Темы: 
// - https://learn.javascript.ru/type-conversions 
// - https://learn.javascript.ru/switch

// Дополнительно:
// - вместо if ..else if ..else.. заиcпользовать конструкцию switch
// - Сделать чтение выражения из одной строки (без лишних <Enter>, но через пробелы)
//  - использовать для этого метод.split(' ');


async function main() {

}

main();